tsung/unit/sign_up.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.6.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" dumptraffic="true" version="1.0">
    <!-- Client side setup -->
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="15000" />
    </clients>
    <!-- Server side setup -->
    <servers>
        <server host="bidding-system-priyankabose.c9users.io" port="443" type="ssl"></server>
    </servers>
    <load>
      <arrivalphase phase="1" duration="30" unit="second">
          <users arrivalrate="1" unit="second"></users>
      </arrivalphase>

      <arrivalphase phase="2" duration="30" unit="second">
          <users arrivalrate="2" unit="second"></users>
      </arrivalphase>

      <arrivalphase phase="3" duration="30" unit="second">
          <users arrivalrate="4" unit="second"></users>
      </arrivalphase>

      <arrivalphase phase="4" duration="30" unit="second">
          <users arrivalrate="8" unit="second"></users>
      </arrivalphase>

      <arrivalphase phase="5" duration="30" unit="second">
          <users arrivalrate="16" unit="second"></users>
      </arrivalphase>
      
      <arrivalphase phase="6" duration="30" unit="second">
          <users arrivalrate="32" unit="second"></users>
      </arrivalphase>
    </load>
    
    <options>
        <option name="global_ack_timeout" value="20000"></option>
        <option type="ts_http" name="user_agent">
            <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
        </option>
    </options>
    
    <sessions>
      <session name="user-signup" probability="10" type="ts_http">
        <!--Sign Up and login-->
        <transaction name="signup">

          <request>
            <http url='/' version='1.1' method='GET'></http>
          </request>

          <request>
            <dyn_variable name="authenticity_token"></dyn_variable>
            <http url="/users/sign_up" version='1.1' method='GET'></http>
          </request>

          <thinktime value="2" random="true"></thinktime>

          <setdynvars sourcetype="eval" code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
            <var name="authenticity_token" />
          </setdynvars>


          <setdynvars sourcetype="random_number" start="1" end="9999">
            <var name="random_email_number" />
          </setdynvars>

          <request subst="true">
            <http url="/users" method="POST" version="1.1"
            contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=tsung%%_random_email_number%%@bid.com&amp;user%5Bpassword%5D=password&amp;user%5Bpassword_confirmation%5D=password&amp;commit=Sign+up"></http>
          </request>
        
        </transaction>

      </session>
    </sessions>
</tsung>